# 1. 데이터 탐색하기

### 데이터 가져오기

In [1]:
import pandas as pd
x_train = pd.read_csv('titanic_x_train.csv', encoding='cp949')
x_test = pd.read_csv('titanic_x_test.csv', encoding='cp949')
y_train = pd.read_csv('titanic_y_train.csv', encoding='cp949')

print(x_train.head(1).T)
print(x_test.head(1).T)

                                   0
PassengerId                        1
티켓등급                               3
승객이름         Braund, Mr. Owen Harris
성별                              male
나이                              22.0
형제자매배우자수                           1
부모자식수                              0
티켓번호                       A/5 21171
운임요금                            7.25
객실번호                             NaN
선착장                                S
                            0
PassengerId               892
티켓등급                        3
승객이름         Kelly, Mr. James
성별                       male
나이                       34.5
형제자매배우자수                    0
부모자식수                       0
티켓번호                   330911
운임요금                   7.8292
객실번호                      NaN
선착장                         Q

In [2]:
print(x_test.head(1).T)

                            0
PassengerId               892
티켓등급                        3
승객이름         Kelly, Mr. James
성별                       male
나이                       34.5
형제자매배우자수                    0
부모자식수                       0
티켓번호                   330911
운임요금                   7.8292
객실번호                      NaN
선착장                         Q

In [3]:
print(y_train.head(5))

   癤풮assengerId  Survived
0             1         0
1             2         1
2             3         1
3             4         1
4             5         0

In [4]:
y_train.columns = ['PassengerId', 'Survived']

In [5]:
print(y_train.head(5))

   PassengerId  Survived
0            1         0
1            2         1
2            3         1
3            4         1
4            5         0

### 행/열 확인하기

In [6]:
print(x_train.shape)

(891, 11)

In [7]:
print(x_test.shape)

(418, 11)

In [8]:
print(y_train.shape)

(891, 2)

### 요약정보 확인하기

In [9]:
print(x_train.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   티켓등급         891 non-null    int64
 2   승객이름         891 non-null    object
 3   성별           891 non-null    object
 4   나이           714 non-null    float64
 5   형제자매배우자수     891 non-null    int64
 6   부모자식수        891 non-null    int64
 7   티켓번호         891 non-null    object
 8   운임요금         891 non-null    float64
 9   객실번호         204 non-null    object
 10  선착장          889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 76.7+ KB
None

In [10]:
print(x_train['성별'].unique().size)

2

In [11]:
print(x_train['성별'].unique())

['male' 'female']

In [12]:
print(x_train['선착장'].unique().size)

4

In [13]:
print(x_train['선착장'].unique())

['S' 'C' 'Q' nan]

In [14]:
print(x_train['승객이름'].unique().size)
print(x_train['티켓번호'].unique().size)
print(x_train['객실번호'].unique().size)

891
681
148

### 기초 통계량 확인하기

In [15]:
print(x_train.describe().T)

             count        mean         std   min       25%       50%    75%  \
PassengerId  891.0  446.000000  257.353842  1.00  223.5000  446.0000  668.5
티켓등급         891.0    2.308642    0.836071  1.00    2.0000    3.0000    3.0
나이           714.0   29.699118   14.526497  0.42   20.1250   28.0000   38.0
형제자매배우자수     891.0    0.523008    1.102743  0.00    0.0000    0.0000    1.0
부모자식수        891.0    0.381594    0.806057  0.00    0.0000    0.0000    0.0
운임요금         891.0   32.204208   49.693429  0.00    7.9104   14.4542   31.0

                  max
PassengerId  891.0000
티켓등급           3.0000
나이            80.0000
형제자매배우자수       8.0000
부모자식수          6.0000
운임요금         512.3292

In [16]:
x_train.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
티켓등급,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
나이,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
형제자매배우자수,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
부모자식수,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
운임요금,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

### 독립변수와 종속변수의 관계 확인하기

In [17]:
data = pd.concat([x_train, y_train], axis=1)
data.head()

,PassengerId,티켓등급,승객이름,성별,나이,형제자매배우자수,부모자식수,티켓번호,운임요금,객실번호,선착장,PassengerId,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,3,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,4,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,5,0

In [18]:
print(data.groupby(['성별'])['Survived'].mean())

성별
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [19]:
print(data.groupby(['티켓등급'])['Survived'].mean())

티켓등급
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [20]:
print(data.groupby(['선착장'])['Survived'].mean())

선착장
C    0.553571
Q    0.389610
S    0.336957
Name: Survived, dtype: float64

# 2. 전처리하기

### 불필요한 칼럼 삭제하기

In [21]:
x_test_passenger_id = x_test['PassengerId']
x_train = x_train.drop(columns = ['PassengerId'])
y_train = y_train.drop(columns = ['PassengerId'])
x_test = x_test.drop(columns = ['PassengerId'])

print(x_train.head())

   티켓등급                                               승객이름      성별    나이  \
0     3                            Braund, Mr. Owen Harris    male  22.0
1     1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2     3                             Heikkinen, Miss. Laina  female  26.0
3     1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4     3                           Allen, Mr. William Henry    male  35.0

   형제자매배우자수  부모자식수              티켓번호     운임요금  객실번호 선착장
0         1      0         A/5 21171   7.2500   NaN   S
1         1      0          PC 17599  71.2833   C85   C
2         0      0  STON/O2. 3101282   7.9250   NaN   S
3         1      0            113803  53.1000  C123   S
4         0      0            373450   8.0500   NaN   S

In [22]:
x_train.head()

,티켓등급,승객이름,성별,나이,형제자매배우자수,부모자식수,티켓번호,운임요금,객실번호,선착장
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
print(y_train.head())

   Survived
0         0
1         1
2         1
3         1
4         0

In [24]:
x_train = x_train.drop(columns = ['티켓번호'])
x_test = x_test.drop(columns = ['티켓번호'])

In [25]:
x_train = x_train.drop(columns = ['승객이름'])
x_test = x_test.drop(columns = ['승객이름'])

### 결측치 처리하기

In [26]:
print(x_train['나이'].isnull().sum())

177

In [27]:
print(x_train['객실번호'].isnull().sum())

687

In [28]:
print(x_train['선착장'].isnull().sum())

2

In [29]:
print(data[['나이', 'Survived']].corr())

                나이  Survived
나이        1.000000 -0.077221
Survived -0.077221  1.000000

In [30]:
data[['나이', 'Survived']].corr()

                나이  Survived
나이        1.000000 -0.077221
Survived -0.077221  1.000000

In [31]:
x_train = x_train.drop(columns = ['나이'])
x_test = x_test.drop(columns = ['나이'])

In [32]:
print(x_train['객실번호'].unique().size)

148

In [33]:
x_train = x_train.drop(columns = ['객실번호'])
x_test = x_test.drop(columns = ['객실번호'])

In [34]:
print(x_train.groupby(['선착장'])['선착장'].count())

선착장
C    168
Q     77
S    644
Name: 선착장, dtype: int64

In [35]:
x_train['선착장'] = x_train['선착장'].fillna('S')
print(x_train['선착장'].isnull().sum())

0

In [36]:
print(x_test['선착장'].isnull().sum())

0

### 범주형 변수를 인코딩하기

In [37]:
x_train['성별'] = x_train['성별'].replace('male',0).replace('female',1)
x_test['성별'] = x_test['성별'].replace('male',0).replace('female',1)
x_train.head(5)

   티켓등급  성별  형제자매배우자수  부모자식수     운임요금 선착장
0     3   0         1      0   7.2500   S
1     1   1         1      0  71.2833   C
2     3   1         0      0   7.9250   S
3     1   1         1      0  53.1000   S
4     3   0         0      0   8.0500   S

In [38]:
선착장_dummy = pd.get_dummies(x_train['선착장'], drop_first=True)\
                .rename(columns={'Q':'선착장Q', 'S':'선착장S'})
선착장_dummy.head()

   선착장Q  선착장S
0     0     1
1     0     0
2     0     1
3     0     1
4     0     1

In [39]:
x_train = pd.concat([x_train, 선착장_dummy], axis=1)
x_train.head()

   티켓등급  성별  형제자매배우자수  부모자식수     운임요금 선착장  선착장Q  선착장S
0     3   0         1      0   7.2500   S     0     1
1     1   1         1      0  71.2833   C     0     0
2     3   1         0      0   7.9250   S     0     1
3     1   1         1      0  53.1000   S     0     1
4     3   0         0      0   8.0500   S     0     1

In [40]:
x_train = x_train.drop(columns=['선착장'])

In [41]:
선착장_dummy = pd.get_dummies(x_test['선착장'], drop_first=True)\
                .rename(columns = {'Q':'선착장Q', 'S':'선착장S'})
선착장_dummy.head()

   선착장Q  선착장S
0     1     0
1     0     1
2     1     0
3     0     1
4     0     1

In [42]:
x_test = pd.concat([x_test, 선착장_dummy], axis=1)
x_test = x_test.drop(columns=['선착장'])
x_test.head()

   티켓등급  성별  형제자매배우자수  부모자식수     운임요금  선착장Q  선착장S
0     3   0         0      0   7.8292     1     0
1     3   1         1      0   7.0000     0     1
2     2   0         0      0   9.6875     1     0
3     3   0         0      0   8.6625     0     1
4     3   1         1      1  12.2875     0     1

### 파생변수 만들기

In [43]:
x_train['가족수'] = x_train['형제자매배우자수'] + x_train['부모자식수']
print(x_train[['형제자매배우자수','부모자식수','가족수']].head())

   형제자매배우자수  부모자식수  가족수
0         1      0    1
1         1      0    1
2         0      0    0
3         1      0    1
4         0      0    0

In [44]:
x_train = x_train.drop(columns=['형제자매배우자수', '부모자식수'])

In [45]:
x_test['가족수'] = x_test['형제자매배우자수'] + x_test['부모자식수']
x_test = x_test.drop(columns = ['형제자매배우자수','부모자식수'])
print(x_test.head())

   티켓등급  성별     운임요금  선착장Q  선착장S  가족수
0     3   0   7.8292     1     0    0
1     3   1   7.0000     0     1    1
2     2   0   9.6875     1     0    0
3     3   0   8.6625     0     1    0
4     3   1  12.2875     0     1    2

# 3. 학습하고 평가하기

### 데이터 분리하기

In [46]:
from sklearn.model_selection import train_test_split

X_TRAIN, X_TEST, Y_TRAIN, Y_TEST = train_test_split(x_train, y_train, test_size=0.2, random_state=10)
print(X_TRAIN.shape)
print(X_TEST.shape)
print(Y_TRAIN.shape)
print(Y_TEST.shape)

(712, 6)
(179, 6)
(712, 1)
(179, 1)

In [47]:
print(Y_TRAIN.head())

     Survived
57          0
717         1
431         1
633         0
163         0

### 데이터 학습 및 하이퍼 파라미터 튜닝하기

In [56]:
from xgboost import XGBClassifier
model1 = XGBClassifier(eval_metric = 'error', random_state=10, use_label_encoder=False)
model1.fit(X_TRAIN, Y_TRAIN)

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
              colsample_bynode=1, colsample_bytree=1, enable_categorical=False,
              eval_metric='error', gamma=0, gpu_id=-1, importance_type=None,
              interaction_constraints='', learning_rate=0.300000012,
              max_delta_step=0, max_depth=6, min_child_weight=1, missing=nan,
              monotone_constraints='()', n_estimators=100, n_jobs=8,
              num_parallel_tree=1, predictor='auto', random_state=10,
              reg_alpha=0, reg_lambda=1, scale_pos_weight=1, subsample=1,
              tree_method='exact', use_label_encoder=False,
              validate_parameters=1, verbosity=None)

In [49]:
model2 = XGBClassifier(n_estimators = 100, max_depth=5, eval_metric='error', 
                       use_label_encoder=False, random_state=10)
model2.fit(X_TRAIN,Y_TRAIN)

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
              colsample_bynode=1, colsample_bytree=1, enable_categorical=False,
              eval_metric='error', gamma=0, gpu_id=-1, importance_type=None,
              interaction_constraints='', learning_rate=0.300000012,
              max_delta_step=0, max_depth=5, min_child_weight=1, missing=nan,
              monotone_constraints='()', n_estimators=100, n_jobs=8,
              num_parallel_tree=1, predictor='auto', random_state=10,
              reg_alpha=0, reg_lambda=1, scale_pos_weight=1, subsample=1,
              tree_method='exact', use_label_encoder=False,
              validate_parameters=1, verbosity=None)

### 결과 예측하기

In [61]:
y_test_predicted = pd.DataFrame(model.predict(x_test))
y_test_predicted.head()

   0
0  0
1  0
2  0
3  0
4  1

In [53]:
Y_TEST_PREDICTED = pd.DataFrame(model.predict(X_TEST))
Y_TEST_PREDICTED.head()

   0
0  0
1  0
2  0
3  1
4  1

### 모델 평가하기

In [54]:
from sklearn.metrics import roc_auc_score

- 1차 학습 모델 평가지표 결과

In [57]:
Y_TEST_PREDICTED_1 = pd.DataFrame(model1.predict(X_TEST))
Y_TEST_PREDICTED_1.head()

   0
0  0
1  0
2  0
3  1
4  1

In [58]:
print(roc_auc_score(Y_TEST, Y_TEST_PREDICTED_1))

0.7731596360628619

In [59]:
Y_TEST_PREDICTED_2 = pd.DataFrame(model2.predict(X_TEST))
Y_TEST_PREDICTED_2.head()

   0
0  0
1  0
2  0
3  1
4  1

In [60]:
print(roc_auc_score(Y_TEST, Y_TEST_PREDICTED_2))

0.7983181692859112

In [66]:
y_test_predicted = pd.DataFrame(model2.predict(x_test)).rename(columns={0:'Survived'})
y_test_predicted.head()

   Survived
0         0
1         1
2         0
3         0
4         1

# 4. 결과 제출하기

In [67]:
print(pd.concat([x_test_passenger_id, y_test_predicted], axis=1))

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         1

[418 rows x 2 columns]

In [68]:
final = pd.concat([x_test_passenger_id, y_test_predicted], axis=1)
final.to_csv('20210112.csv', index=False)

In [74]:
import pandas as pd
# 데이터 가져오기
x_train = pd.read_csv('titanic_x_train.csv', encoding='cp949')
x_test = pd.read_csv('titanic_x_test.csv', encoding='cp949')
y_train = pd.read_csv('titanic_y_train.csv', encoding='cp949')

# 전처리하기
x_test_passenger_id = x_test['PassengerId']
x_train = x_train.drop(columns=['PassengerId','티켓번호', '승객이름','나이','객실번호'])
x_test = x_test.drop(columns=["PassengerId",'티켓번호', '승객이름','나이','객실번호'])
y_train.columns=['PassengerId', 'Survived']
y_train.head()

   PassengerId  Survived
0            1         0
1            2         1
2            3         1
3            4         1
4            5         0

In [77]:
import pandas as pd
# 데이터 가져오기
x_train = pd.read_csv('titanic_x_train.csv', encoding='cp949')
x_test = pd.read_csv('titanic_x_test.csv', encoding='cp949')
y_train = pd.read_csv('titanic_y_train.csv', encoding='cp949')

# 전처리하기
x_test_passenger_id = x_test['PassengerId']
x_train = x_train.drop(columns=['PassengerId','티켓번호', '승객이름','나이','객실번호'])
x_test = x_test.drop(columns=["PassengerId",'티켓번호', '승객이름','나이','객실번호'])
y_train.columns=['PassengerId', 'Survived']
y_train = y_train.drop(columns=['PassengerId'])

# 결측치 처리하기
x_train['선착장'] = x_train['선착장'].fillna('S')
x_test['선착장'] = x_train['선착장'].fillna('S')

# 인코딩 수행하기
x_train['성별'] = x_train['성별'].replace('male',0).replace('female',1)
x_test['성별'] = x_test['성별'].replace('male',0).replace('female',1)
선착장_dummy = pd.get_dummies(x_train['선착장'], drop_first=True).rename(\
                columns={'Q':'선착장Q', 'S':'선착장S'})
x_train = pd.concat([x_train, 선착장_dummy], axis=1)
x_train = x_train.drop(columns=['선착장'])
선착장_dummy = pd.get_dummies(x_test['선착장'], drop_first=True).rename(\
                columns={'Q':'선착장Q', 'S':'선착장S'})
x_test = pd.concat([x_test,선착장_dummy], axis=1)
x_test = x_test.drop(columns=['선착장'])

# 파생변수 만들기
x_train['가족수'] = x_train['형제자매배우자수'] + x_train['부모자식수']
x_train = x_train.drop(columns=['형제자매배우자수','부모자식수'])
x_test['가족수'] = x_test['형제자매배우자수'] + x_test['부모자식수']
x_test = x_test.drop(columns=['형제자매배우자수','부모자식수'])

# 데이터분리하기
from sklearn.model_selection import train_test_split
X_TRAIN, X_TEST, Y_TRAIN, Y_TEST = train_test_split(x_train, y_train, test_size=0.2, random_state=10)

# 모델 학습하기
from xgboost import XGBClassifier
model = XGBClassifier(n_estimators=100, max_depth=5, eval_metric='error', random_state=10, use_label_encoder=False)
model.fit(X_TRAIN,Y_TRAIN)

# 최종 결과를 파일로 저장하기
y_test_predicted = pd.DataFrame(model.predict(x_test)).rename(columns={0:'Survived'})
final = pd.concat([x_test_passenger_id, y_test_predicted], axis=1)
final.to_csv('20210112_2.csv', index=False)